In [1]:
"""
Q1. List any five functions of the pandas library with execution.

Ans: 1. Groupby()
     2. concat()
     3. merge()
     4. join()
     5. drop()

In [1]:
import pandas as pd

In [10]:
#creating dataframe for operation.
data={
    'name': ['abhik','pintu','manish'],
    'gpa': [3.12,2.93,3.54],
    'age': [34,23,22],
    'salary': [10000,120000,450000],
    'sex': ['m','m','f']
}

In [11]:
df1=pd.DataFrame(data)

In [12]:
df1

     name   gpa  age  salary sex
0   abhik  3.12   34   10000   m
1   pintu  2.93   23  120000   m
2  manish  3.54   22  450000   f

In [14]:
#gropby() function
obj=df1.groupby('sex')

In [15]:
obj.mean()

/tmp/ipykernel_112/1582909037.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  obj.mean()

       gpa   age    salary
sex
f    3.540  22.0  450000.0
m    3.025  28.5   65000.0

In [17]:
data2={
    'address':['siraha','kathmandu','pokhara'],
    'degree': ['IT', 'Engineer', 'Doctor']

}

In [20]:
df2=pd.DataFrame(data2)

In [22]:
# 2 concatenation operation
pd.concat([df1, df2], axis=1)

     name   gpa  age  salary sex    address    degree
0   abhik  3.12   34   10000   m     siraha        IT
1   pintu  2.93   23  120000   m  kathmandu  Engineer
2  manish  3.54   22  450000   f    pokhara    Doctor

In [23]:
data3={
    'name': ['abishek', 'manish'],
    'hoobies': ['football', 'badminter']
}

In [24]:
df3=pd.DataFrame(data3)

In [25]:
df3

      name    hoobies
0  abishek   football
1   manish  badminter

In [27]:
#merge() function.
pd.merge(df1, df3)

     name   gpa  age  salary sex    hoobies
0  manish  3.54   22  450000   f  badminter

In [31]:
df2

     address    degree
0     siraha        IT
1  kathmandu  Engineer
2    pokhara    Doctor

In [32]:
df3

      name    hoobies
0  abishek   football
1   manish  badminter

In [33]:
#join function.
df2.join(df3, how='left')

     address    degree     name    hoobies
0     siraha        IT  abishek   football
1  kathmandu  Engineer   manish  badminter
2    pokhara    Doctor      NaN        NaN

In [34]:
#drop function.
df2.drop(1)

   address  degree
0   siraha      IT
2  pokhara  Doctor

In [ ]:
"""
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.
"""

In [59]:
Dframe={
    'A': [1,2,3,4],
    'B':[5,6,7,8],
    'C': [9,10,11,12]
}

In [ ]:
df4=pd.DataFrame(Dframe)

In [61]:
reindex=[i for i in range(1,9,2)]

In [62]:
reindex

[1, 3, 5, 7]

In [65]:
df4.reindex(reindex)

     A    B     C
1  2.0  6.0  10.0
3  4.0  8.0  12.0
5  NaN  NaN   NaN
7  NaN  NaN   NaN

In [50]:
"""
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
"""

In [1]:
import pandas as pd
daframe={'values': [10,20,30,40,50]}

In [2]:
df5=pd.DataFrame(daframe)

In [3]:
df5

   values
0      10
1      20
2      30
3      40
4      50

In [5]:
sum=0
for i,j in df5.head(3).iterrows():
    sum=sum+j
print(sum)

values    60
dtype: int64

In [ ]:
"""
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

Ans:

In [1]:
import pandas as pd

In [6]:
pd.set_option("display.max_colwidth",200)
df1=pd.DataFrame({
    'Text': ['Hello, This is abishek kumar yadav student of data science']
})

In [17]:
df1['word_count']=df1['Text'].apply(lambda x : len(x.split()))

In [18]:
df1

                                                         Text  word_count
0  Hello, This is abishek kumar yadav student of data science          10

In [19]:
'''
Q5. How are DataFrame.size() and DataFrame.shape() different?
'''

In [23]:
#Dataframe.size(): .size() return the total number of integer value in the dataframe.
dataframe=pd.DataFrame({
    'val1':[1,2,3,4],
    'val2': [5,6,7,8]
})

In [24]:
dataframe

   val1  val2
0     1     5
1     2     6
2     3     7
3     4     8

In [26]:
dataframe.size

8

In [27]:
# Dataframe. shape() : .shape return dimensional of of the data frame.

In [28]:
dataframe2=pd.DataFrame({
    'val1':[1,2,3,4],
    'val2': [5,6,7,8]
})

In [29]:
dataframe2.shape

(4, 2)

In [ ]:
"""
Q6. Which function of pandas do we use to read an excel file?

Ans: To read the excel file in pandas we use pd.read_excel('file_name.xlsx')

"""

In [ ]:
"""
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
"""

In [36]:
df3=pd.DataFrame({
    'Email':['abishek@gmail.com', 'yadav@gmail.com', 'kumar@gmail.com']
})

In [37]:
df3

               Email
0  abishek@gmail.com
1    yadav@gmail.com
2    kumar@gmail.com

In [38]:
df3['user_name']=df3['Email'].apply(lambda x: x[0:x.index('@')])

In [39]:
df3

               Email user_name
0  abishek@gmail.com   abishek
1    yadav@gmail.com     yadav
2    kumar@gmail.com     kumar

In [ ]:
"""
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
"""

In [2]:
df4=pd.DataFrame({
    'A': [3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]

})

In [3]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [54]:
"""
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.
"""

df6=pd.DataFrame({
    'Values': [100,234,4212,435]
})

In [55]:
df6

   Values
0     100
1     234
2    4212
3     435

In [56]:
df6.mean()

Values    1245.25
dtype: float64

In [57]:
df6.median()

Values    334.5
dtype: float64

In [58]:
df6.std()

Values    1982.619038
dtype: float64

In [ ]:
"""
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.
"""

In [64]:
df6=pd.DataFrame({
    'Sales':[10012,24242,12432,423424,412,4124,45,6756,787,676,234,343,2342,434],
    'column_Date':['2020-1-1','2020-1-2','2020-1-3','2020-1-4','2020-1-5','2020-1-6','2020-1-7','2020-1-8','2020-1-9','2020-1-10','2020-1-11','2020-1-12','2020-1-13','2020-1-14']
})

In [65]:
df6

     Sales column_Date
0    10012    2020-1-1
1    24242    2020-1-2
2    12432    2020-1-3
3   423424    2020-1-4
4      412    2020-1-5
5     4124    2020-1-6
6       45    2020-1-7
7     6756    2020-1-8
8      787    2020-1-9
9      676   2020-1-10
10     234   2020-1-11
11     343   2020-1-12
12    2342   2020-1-13
13     434   2020-1-14

In [67]:
df6['Sales'].rolling(window=7).mean()

0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
5              NaN
6     67813.000000
7     67347.857143
8     63997.142857
9     62317.714286
10     1862.000000
11     1852.142857
12     1597.571429
13     1653.142857
Name: Sales, dtype: float64

In [ ]:
"""
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [70]:
date=pd.date_range(start='2023-01-01', end='2023-01-05')

In [71]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [81]:
df8=pd.DataFrame({'Date':date})

In [82]:
df8

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [84]:
df8['week_day']=df8['Date'].dt.day_name()

In [85]:
df8

        Date   week_day
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
"""
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
"""

In [86]:
date1=pd.date_range(start='2023-01-01', end='2023-02-15')

In [87]:
df9=pd.DataFrame({'Date':date1})

In [89]:
df9.head()

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [101]:
df10= df9[(df9['Date'] > '2023-01-01') & (df9['Date'] <= '2023-01-31')]

In [102]:
df10

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [ ]:
"""
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans: To use the basic function of pandas most necessary library that needs to imported is "import pandas as pd".

"""